import '../sass/main.scss';

const refs = {
  startBtn: document.querySelector('.footer-button'),
  stopBtn: document.querySelector('.stop'),
  box: document.querySelector('.box-section-hero__text'),
  text: document.querySelector('.text'),
  boxHistory: document.querySelector('.box-section-hero__texti-history'),
  load: document.querySelector('.animation'),
};

const questions = [
  `Твои самые распространенные сексуальные фантазии ?`,
  `Есть ли в фантазиях место мне?`,
  `Запретная тема в сексе?`,
  `Любишь эксперименты?`,
  `Расскажешь о первом сексуальном опыте?`,
  `Самая эротичная часть мужского тела?`,
  `Равнозначны понятия занятия любовью и сексом?`,
  `Во сколько лет испытала первый оргазм?`,
  `Помнишь первого парня, от вида которого возбудилась?`,
  `Какие интимные игры больше всего возбуждают?`,
  `Прелюдия – долго и страстно или не обязательна?`,
  `Что неприемлемо в постели?`,
  `Часто фантазируешь на интимные темы?`,
  `Хочешь воплотить эротические фантазии со мной?`,
  `Кто из медийных персонажей возбуждает (актер, певец, ведущий, известный блогер)?`,
  `Как тебя быстро возбудить, что на это влияет?`,
  `Любимая поза во время секса?`,
  `Какую позицию ненавидишь?`,
  `У тебя есть вибратор или другие игрушки?`,
  `Часто ходишь в интимный магазин?`,
  `Посещала сексшоп вместе с парнем?`,
  `Нравится частая смена поз во время полового акта?`,
  `Любимая игрушка из арсенала магазина для взрослых?`,
  `Когда последний раз пользовалась вибратором?`,
  `Какие игрушки готова попробовать во время интима со мной?`,
  `Расскажи о самой бесстыдной фантазии.`,
  `Участвовала в ролевых играх?`,
  `В какой роли видишь меня?`,
  `Был ли неудачный опыт, поделись.`,
  `Где расположена твоя эрогенная зона?`,
  `Какой у тебя размер груди?`,
  `На что парни чаще обращают внимание в твоем теле: попа или грудь?`,
  `Сколько партнеров у тебя было?`,
  `Был ли опыт оральных ласк без продолжения (тебе или ты)?`,
  `О чем думаешь во время оргазма?`,
  `Хочешь меня прямо сейчас?`,
  `Снятся эротические сны?`,
  `Я участвовал в твоих эротических сновидениях?`,
  `Самый длительный период без секса?`,
  `Обсуждаешь секс с подругами?`,
  `Что нового хочешь привнести в свою интимную жизнь?`,
  `Испытывала одновременный оргазм с молодым человеком?`,
  `Пробовала лесбийские ласки?`,
  `Нравится анальный секс?`,
  `Участвовала в БДСМ сессиях?`,
  `Во время 69 с парнем предпочитаешь быть снизу или сверху?`,
  `Нравится 69 с девушками?`,
  `Мастурбировала на геев?`,
  `Как относишься к лесбийскому сексу со страпоном?`,
  `Любишь оральные ласки?`,
  `Как часто делаешь минет парням?`,
  `Глотать или выплевывать?`,
  `Любишь делать куни девушкам или только минет парням?`,
  `Когда последний раз удовлетворяла сама себя?`,
  `Максимальное количество самоудовлетворений за один день?`,
  `Какое порно возбуждает больше всего?`,
  `Часто смотришь порнофильмы?`,
  `Во время просмотра удовлетворяешь себя рукой или игрушкой?`,
  `Спонтанный секс с незнакомцем: сколько раз и понравилось ли?`,
  `Участвовала в оргиях?`,
  `Допускаешь секс с лучшей подругой?`,
  `Спала с кем-то из друзей или близких парня?`,
  `Когда-нибудь отдавалась за деньги или дорогой подарок?`,
  `Самый экстремальный секс в жизни?`,
  `Как лишилась девственности?`,
  `Практикуешь незащищенный секс?`,
  `Возбуждает измена?`,
  `Переспала бы с преподавателем, который нравится?`,
  `Был интим в публичном месте?`,
  `Самоудовлетворяешься, представляя кого-то из моих друзей?`,
  `Приемлешь секс по дружбе?`,
  `Подсматривала за мальчиками в раздевалке в детстве?`,
  `Бреешь киску или делаешь интимную стрижку?`,
  `Любишь бритый пах или все равно?`,
  `Мастурбировала вместе с подружкой?`,
  `Согласилась бы на взаимное самоудовлетворение с парнем без последующего акта?`,
  `Возбуждают фетиши, в том числе фут-фетиш?`,
  `Сколько лет было самому старшему и самому младшему партнерам?`,
  `Занималась сексом с несовершеннолетними?`,
  `Переспишь с моим другом, если я буду не против?`,
  `Подчиняться или доминировать?`,
  `Если бы застала меня с другой девушкой, присоединилась бы?`,
  `Что приобретешь в магазине для взрослых для нас обоих?`,
  `Возбудишься, если во время секса на нас будет смотреть кто-то посторонний?`,
  `Оральные ласки с другим партнером – измена?`,
  `Кончала во время прелюдий?`,
  `У тебя был сквирт?`,
  `Если секс втроем, то в презервативе?`,
  `Оральные ласки только в кондоме или без?`,
  `Делала минет парню пока он за рулем?`,
  `Мечтала о съемках в порно?`,
  `Как накажешь меня за такие вопросы?`,
  `Кого захотела впервые в жизни, что аж трусы промокли?`,
  `Сколько раз за ночь должен быть секс?`,
  `Как быстро кончаешь во время мастурбации?`,
  `Сколько времени требуется для того, чтобы кончить с партнером?`,
  `Какой оргазм ярче: вагинальный или клиторальный?`,
  `Смущаешься при покупке презервативов?`,
  `Какие моменты из порно возбуждают?`,
  `Встречая красивого парня, представляешь, как он входит в тебя?`,
  `Была на нудистком пляже?`,
  `Где находится точка G?`,
  `Пробовала записывать свой секс на видео?`,
  `Как относишься к интиму с чернокожими или азиатами?`,
  `Возбуждаешься от поцелуев в грудь?`,
  `Сколько раз отдавалась пьяной на вписках?`,
  `Возбуждаешься под воздействием алкоголя?`,
  `Приемлешь примирение через постель?`,
  `Как называешь свою киску?`,
  `Читала Камасутру?`,
  `Хотела бы попробовать новые позы со мной?`,
  `При свете или в кромешной тьме?`,
  `Любимая музыка для интима?`,
  `Попробовала бы связывание со мной?`,
  `Заводит неприличная лексика из уст партнера?`,
  `Половой акт на кухонном столе или балконе – реальность или табу?`,
  `Нежный акт или жесткая долбежка?`,
  `Готова уступить парня на одну ночь лучшей подруге?`,
  `Спала с девственником?`,
  `Секс до свадьбы существует?`,
  `Был опыт с закомплексованными парнями?`,
  `Накачанные мускулы или большой член?`,
  `Какой размер нравится больше всего?`,
  `Сколько раз в день (неделю) достаточно для полного удовлетворения?`,
  `Пробовала перед зеркалом?`,
  `Упругий фаллос или накаченная попа?`,
  `Как часто фантазируешь о других мужчинах?`,
  `Возбуждают спортивные, подтянутые или тучные?`,
  `Половые отношения с одним мужчиной – печаль?`,
  `Расскажи об идеальном акте в твоей жизни.`,
  `Мнение подруг влияет на то, будет у тебя с парнем или нет?`,
  `Секс или любовь?`,
  `Возможна любовь без секса, а секс без любви?`,
  `Берешь на первое свидание кондомы?`,
  `Кто должен заботиться о безопасности и покупать контрацептивы?`,
  `Практиковала секс с разными партнерами в течение одного дня?`,
  `Самый любимый вариант секса, представим, что другие после выбора запретят?`,
  `Готовишь завтрак голой?`,
  `Какая часть моего тела тебе больше всего нравится?`,
  `Откуда начнешь массаж?`,
  `В какие моменты возбуждаю больше всего?`,
  `Хочешь стриптиз?`,
  `Часто хочется кричать в постели?`,
  `Ревнуешь, когда разговариваю с твоими подругами?`,
  `Сверху или снизу?`,
  `В машине или на природе?`,
];

// function getRandomInRange(min, max) {
//   return Math.floor(Math.random() * (max - min + 1)) + min;
// }

// refs.box.textContent = 'Нажми на start';

// function start() {
//   // let random = getRandomInRange(0, 8);
//   // refs.box.textContent = '';
//   // const render = `<h1 class="title"> ${questions[random]} </h1>`;
//   // return refs.box.insertAdjacentHTML('beforeend', render);
// }

// class Questions {
//   constructor() {
//     this.counter = 0;
//     this.intervalid = null;
//     this.isActive = false;
//   }

//   getRandomInRange(min, max) {
//     return Math.floor(Math.random() * (max - min + 1)) + min;
//   }

//   createRender() {
//     if (this.isActive) {
//       return;
//     }

//     refs.text.textContent = this.counter += 1;
//     const textForHistory = `<div class="text-for-history">${refs.box.textContent}<div>`;

//     this.intervalid = setInterval(() => {
//       this.isActive = true;

//       refs.box.textContent = '';
//       const index = this.getRandomInRange(0, questions.length - 1);

//       const r = `<h1 class="title"> ${questions[index]} </h1>`;

//       return refs.box.insertAdjacentHTML('beforeend', r);
//     }, 50);

//     refs.boxHistory.insertAdjacentHTML('beforeend', textForHistory);
//   }

//   stop() {
//     this.isActive = false;
//     // this.counter = 0;
//     // refs.text.textContent = 0;
//     clearTimeout(this.intervalid);
//   }
// }

// const question = new Questions({});

// refs.startBtn.addEventListener(`click`, question.createRender.bind(question));
// refs.stopBtn.addEventListener(`click`, question.stop.bind(question));

// var arr = []; //записываем в этот массив рандомные числа
// var max = 100; // максимальная длина массива
// var rundomnumber; //случайное число

// while (arr.length <= max) {
//   rundomnumber = Math.floor(Math.random() * max); //создадим случайное число

//   if (arr.indexOf(rundomnumber) == -1) {
//     // проверим есть оно  у нас или нет

//     arr.push(rundomnumber); // записываем в массив т.к нету
//   }
// }

class Questions {
  constructor() {
    this.counter = 0;
    this.intervalid = null;
    this.isActive = false;
    this.arr = [];
  }

  rrr(max) {
    var max;
    var rundomnumber;
    console.log(this.arr);
    while (this.arr.length <= max) {
      rundomnumber = Math.floor(Math.random() * max);

      if (this.arr.indexOf(rundomnumber) == -1) {
        this.arr.push(rundomnumber);
        return rundomnumber;
      }
    }
  }

  createRender() {
    refs.load.classList.remove(`visually-hidden`);
    refs.load.classList.add(`load`);
    refs.box.classList.add(`transform`);

    this.intervalid = setTimeout(() => {
      refs.text.textContent = this.counter += 1;
      const textForHistory = `<div class="text-for-history">${refs.box.textContent}</div>`;

      this.isActive = true;

      refs.box.textContent = '';
      const index = this.rrr(questions.length - 1);

      const r = `<h1 class="title"> ${questions[index]} </h1>`;
      refs.boxHistory.insertAdjacentHTML('beforeend', textForHistory);
      refs.box.classList.remove(`transform`);
      refs.load.classList.remove(`load`);
      refs.load.classList.add(`visually-hidden`);
      // refs.historyText.classList.add(`text-for-history-transform`);
      return refs.box.insertAdjacentHTML('beforeend', r);
    }, 2000);
  }

  stop() {
    this.counter = 0;
    refs.text.textContent = 0;
    refs.boxHistory.textContent = 'В очікуванні на нові запитання';
    refs.box.textContent = 'Не зупиняйся, продовжуй використовувати цю чудову программу';
    this.arr = [];
  }
}

const question = new Questions({});

refs.startBtn.addEventListener(`click`, question.createRender.bind(question));
refs.stopBtn.addEventListener(`click`, question.stop.bind(question));
